# XDirection Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Ellipse..::..XDirection Property
Ellipse Class See Also
---
The X direction.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public XYZ XDirection { get; }
```

Visual Basic
---
```text
Public ReadOnly Property XDirection As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ XDirection {
	XYZ^ get ();
}
```

# See Also
Ellipse Class
Autodesk.Revit.DB Namespace